#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
  ```

  terraform
module.k8s.module.vault-beryjuorg-prd.vault_auth_backend.kubernetes: Refreshing state... [id=k8s-prd]
module.vault.module.github-vault-oidc.vault_jwt_auth_backend.github_oidc: Refreshing state... [id=github-actions]
module.vault.vault_policy.github-terraform: Refreshing state... [id=github-terraform]
module.vault.vault_mount.pki-machine: Refreshing state... [id=pki-machine]
module.vault.vault_policy.monitoring: Refreshing state... [id=monitoring]
module.vault.vault_aws_secret_backend_role.role-admin-tf: Refreshing state... [id=aws/roles/admin-tf]
module.vault.vault_policy.vault-secrets-operator: Refreshing state... [id=vault-secrets-operator]
module.k8s.module.vault-beryjuorg-offsite.vault_auth_backend.kubernetes: Refreshing state... [id=k8s-offsite]
module.k8s.module.vault-beryjuorg-defr.vault_auth_backend.kubernetes: Refreshing state... [id=k8s-defr]
module.k8s.module.vault-beryjuorg-mon.vault_auth_backend.kubernetes: Refreshing state... [id=k8s-mon]
module.vault.vault_aws_secret_backend_role.role-route53: Refreshing state... [id=aws/roles/route53]
module.vault.vault_mount.pki-istio: Refreshing state... [id=pki-istio]
module.vault.vault_policy.puppet-node: Refreshing state... [id=puppet-node]
module.vault.vault_aws_secret_backend_role.role-admin: Refreshing state... [id=aws/roles/admin]
module.vault.vault_aws_secret_backend_role.role-ses: Refreshing state... [id=aws/roles/ses-send]
module.vault.vault_auth_backend.puppet-cert: Refreshing state... [id=cert]
module.k8s.module.vault-beryjuorg-prd.vault_kubernetes_auth_backend_role.workstation: Refreshing state... [id=auth/k8s-prd/role/workstation]
module.vault.vault_jwt_auth_backend.authentik-oidc: Refreshing state... [id=authentik]
module.k8s.module.vault-beryjuorg-prd.vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/k8s-prd/config]
module.vault.vault_pki_secret_backend_config_urls.pki-machine-urls: Refreshing state... [id=pki-machine/config/urls]
module.k8s.module.vault-beryjuorg-prd.vault_kubernetes_auth_backend_role.vault-secrets-operator: Refreshing state... [id=auth/k8s-prd/role/vault-secrets-operator]
module.k8s.module.vault-beryjuorg-defr.vault_kubernetes_auth_backend_role.workstation: Refreshing state... [id=auth/k8s-defr/role/workstation]
module.vault.vault_pki_secret_backend_role.pki-machine-role: Refreshing state... [id=pki-machine/roles/beryjuorg-machine]
module.k8s.module.vault-beryjuorg-offsite.vault_kubernetes_auth_backend_role.vault-secrets-operator: Refreshing state... [id=auth/k8s-offsite/role/vault-secrets-operator]
module.k8s.module.vault-beryjuorg-defr.vault_kubernetes_auth_backend_role.vault-secrets-operator: Refreshing state... [id=auth/k8s-defr/role/vault-secrets-operator]
module.k8s.module.vault-beryjuorg-defr.vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/k8s-defr/config]
module.vault.vault_pki_secret_backend_role.pki-istio-role: Refreshing state... [id=pki-istio/roles/beryjuorg-istio]
module.vault.vault_pki_secret_backend_config_urls.pki-istio-urls: Refreshing state... [id=pki-istio/config/urls]
module.k8s.module.vault-beryjuorg-mon.vault_kubernetes_auth_backend_role.workstation: Refreshing state... [id=auth/k8s-mon/role/workstation]
module.k8s.module.vault-beryjuorg-mon.vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/k8s-mon/config]
module.k8s.module.vault-beryjuorg-offsite.vault_kubernetes_auth_backend_config.config: Refreshing state... [id=auth/k8s-offsite/config]
module.k8s.module.vault-beryjuorg-mon.vault_kubernetes_auth_backend_role.vault-secrets-operator: Refreshing state... [id=auth/k8s-mon/role/vault-secrets-operator]
module.k8s.module.vault-beryjuorg-offsite.vault_kubernetes_auth_backend_role.workstation: Refreshing state... [id=auth/k8s-offsite/role/workstation]
module.vault.module.github-vault-oidc.vault_jwt_auth_backend_role.github_oidc_role["github-terraform"]: Refreshing state... [id=auth/github-actions/role/github-terraform]
module.grafana.grafana_folder.beryjuorg-thanos: Refreshing state... [id=277]
module.grafana.grafana_folder.beryjuorg-minio: Refreshing state... [id=199]
module.vault.vault_cert_auth_backend_role.puppet-root: Refreshing state... [id=auth/cert/certs/puppet]
module.grafana.grafana_folder.beryjuorg-adguard: Refreshing state... [id=205]
module.grafana.grafana_folder.beryjuorg-redis: Refreshing state... [id=208]
module.grafana.grafana_folder.beryjuorg-gitlab: Refreshing state... [id=202]
module.grafana.grafana_folder.beryjuorg-netapp: Refreshing state... [id=203]
module.grafana.grafana_folder.beryjuorg-unifi: Refreshing state... [id=209]
module.grafana.grafana_folder.beryjuorg-postgres: Refreshing state... [id=210]
module.grafana.grafana_folder.beryjuorg-k8s-nginx: Refreshing state... [id=206]
module.vault.vault_jwt_auth_backend_role.default_role: Refreshing state... [id=auth/authentik/role/default_role]
module.grafana.grafana_folder.beryjuorg-istio: Refreshing state... [id=212]
module.grafana.grafana_folder.beryjuorg-k8s-preset: Refreshing state... [id=204]
module.grafana.grafana_folder.beryjuorg-k8s-flux: Refreshing state... [id=207]
module.authentik.authentik_service_connection_kubernetes.local: Refreshing state... [id=1ff43459-90fb-4e85-8f01-9f1f0b7ae44a]
module.rancher.rancher2_cluster.beryjuorg-prd: Refreshing state... [id=c-8xt2d]
module.rancher.rancher2_cluster.beryjuorg-offsite: Refreshing state... [id=c-9tdsj]
module.rancher.rancher2_cluster.beryjuorg-defr: Refreshing state... [id=c-8j869]
module.authentik.authentik_flow.ldap-flow: Refreshing state... [id=ldap-flow]
module.authentik.authentik_property_mapping_saml.aws-role: Refreshing state... [id=7b253c9b-52b2-4aac-b5f6-f797f64ea358]
module.authentik.authentik_property_mapping_saml.aws-role-session-name: Refreshing state... [id=222d3112-3b95-443a-a92a-8a4a74749611]
module.authentik.authentik_stage_user_login.ldap-flow-login: Refreshing state... [id=d219b4c2-60bd-4e60-9f57-ee9b84448585]
module.authentik.authentik_stage_password.ldap-flow-password: Refreshing state... [id=bfbf5ef7-fd32-4d6c-9197-e9cc8e3b4935]
module.vms.vsphere_role.veeam: Refreshing state... [id=115633556]
module.grafana.grafana_dashboard.gitlab-rails-app: Refreshing state... [id=36owr67Wz]
module.grafana.grafana_dashboard.gitlab-praefect: Refreshing state... [id=8EAXC-AWz]
module.grafana.grafana_dashboard.gitlab-postgresql: Refreshing state... [id=c_LJgXfmk]
module.grafana.grafana_dashboard.gitlab-nfs-mountstats: Refreshing state... [id=keQ9P_-iz]
module.grafana.grafana_dashboard.gitlab-redis: Refreshing state... [id=XDaNK6amz]
module.grafana.grafana_dashboard.gitlab-nginx: Refreshing state... [id=SIHl30qik]
module.grafana.grafana_dashboard.gitlab-overview: Refreshing state... [id=wsSteMemz]
module.grafana.grafana_dashboard.gitlab-gitaly: Refreshing state... [id=x6Z50y-iz]
module.grafana.grafana_dashboard.gitlab-registry: Refreshing state... [id=k7-rFGGZk]
module.grafana.grafana_dashboard.gitlab-service_platform_metrics: Refreshing state... [id=general-service]
module.grafana.grafana_dashboard.minio: Refreshing state... [id=TgmJnqnnk]
module.grafana.grafana_dashboard.unifi-uap-insight: Refreshing state... [id=g5wFWqxZk]
module.grafana.grafana_dashboard.adguard: Refreshing state... [id=MIBVglomg]
module.grafana.grafana_dashboard.postgres: Refreshing state... [id=wGgaPlciz]
module.grafana.grafana_dashboard.redis: Refreshing state... [id=sPi_v1bnk]
module.grafana.grafana_dashboard.thanos: Refreshing state... [id=0cb8830a6e957978796729870f560cda]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_snapmirror: Refreshing state... [id=YRX5I_w7k]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_svm_details: Refreshing state... [id=rErZJO_7z]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_shelf: Refreshing state... [id=ee_cI_w7z]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_aggregate: Refreshing state... [id=a-_cSlwnz]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_disk: Refreshing state... [id=bylcS_w7k]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_metadata: Refreshing state... [id=Zl_5I_Q7k]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_network_detail: Refreshing state... [id=3__cIlwnz]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_lun: Refreshing state... [id=AUlcSlQ7z]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_volume_details: Refreshing state... [id=FWucSlwnz]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_cluster: Refreshing state... [id=-f_5IlQ7z]
module.grafana.grafana_dashboard.netapp-harvest_dashboard_node_details: Refreshing state... [id=Arl5I_Q7z]
module.grafana.grafana_dashboard.thanos-rule: Refreshing state... [id=35da848f5f92b2dc612e0c3a0577b8a1]
module.grafana.grafana_dashboard.unifi-client-insight: Refreshing state... [id=jMfvAjxWz]
module.grafana.grafana_dashboard.thanos-receive: Refreshing state... [id=916a852b00ccc5ed81056644718fa4fb]
module.grafana.grafana_dashboard.thanos-query: Refreshing state... [id=af36c91291a603f1d9fbdabdd127ac4a]
module.grafana.grafana_dashboard.thanos-query-frontend: Refreshing state... [id=7c68ed2ef2355474f058dd27f0471f7a]
module.vms.module.nas.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_31.20.120.10.in-addr.arpa_PTR]
module.vms.module.vault.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_69.0.120.10.in-addr.arpa_PTR]
module.vms.module.ak-dev-k3s.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_67.0.120.10.in-addr.arpa_PTR]
module.vms.module.mc-peaceful.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_76.0.120.10.in-addr.arpa_PTR]
module.vms.module.napp-prd2.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclprd2.prod.beryju.org_A]
module.vms.module.k8s-prd-w[3].module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_86.0.120.10.in-addr.arpa_PTR]
module.vms.module.analytics.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_analytics1.prod.beryju.org_A]
module.vms.module.ak-dev-k3s.module.net.aws_route53_record.main: Refreshing state... [id=Z075720839VZLEYWCGF7B_ak-dev-k3s1.lab.beryju.org_A]
module.vms.module.plex.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_plex1.prod.beryju.org_A]
module.vms.module.ext-sentry1.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_168.239.61.202.in-addr.arpa_PTR]
module.vms.module.k8s-prd-w[1].module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_64.0.120.10.in-addr.arpa_PTR]
module.vms.module.mon.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_mon1.prod.beryju.org_A]
module.vms.module.nas.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_nas1.prod.beryju.org_A]
module.vms.module.unifi.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_74.20.120.10.in-addr.arpa_PTR]
module.vms.module.napp-bck1.aws_route53_record.additional["0"]: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclbck1n1.prod.beryju.org_A]
module.vms.module.k8s-prd-w[2].module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_k8s-prd-w3.prod.beryju.org_A]
module.vms.module.esxi-defr.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_esxi3.prod.beryju.org_A]
module.vms.module.k8s-prd-w[1].module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_k8s-prd-w2.prod.beryju.org_A]
module.vms.module.k8s-prd-w[3].module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_k8s-prd-w4.prod.beryju.org_A]
module.vms.module.plex.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_76.20.120.10.in-addr.arpa_PTR]
module.vms.module.k8s-prd-c.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_83.0.120.10.in-addr.arpa_PTR]
module.vms.module.napp-prd1.aws_route53_record.additional["0"]: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclprd1n1.prod.beryju.org_A]
module.vms.module.napp-prd2.aws_route53_record.additional-reverse["0"]: Refreshing state... [id=Z07534501KETL314B9LHZ_161.20.120.10.in-addr.arpa_PTR]
module.vms.module.esxi-uk.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_esxi4.prod.beryju.org_A]
module.vms.module.dev.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_2.99.120.10.in-addr.arpa_PTR]
module.vms.module.vcenter.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_2.0.120.10.in-addr.arpa_PTR]
module.vms.module.esxi-uk.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_10.3.120.10.in-addr.arpa_PTR]
module.vms.module.ext-sentry1.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_sentry1.prod.beryju.org_A]
module.vms.module.napp-bck1.aws_route53_record.additional["1"]: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclbck1n1sp.prod.beryju.org_A]
module.vms.module.analytics.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_85.0.120.10.in-addr.arpa_PTR]
module.vms.module.esxi-defr.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_20.20.120.10.in-addr.arpa_PTR]
module.vms.module.netbox.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_68.0.120.10.in-addr.arpa_PTR]
module.vms.module.puppet.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_80.0.120.10.in-addr.arpa_PTR]
module.vms.module.mc.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_mc1.prod.beryju.org_A]
module.vms.module.dev.module.net.aws_route53_record.main: Refreshing state... [id=Z075720839VZLEYWCGF7B_dev1.lab.beryju.org_A]
module.vms.module.napp-bck1.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_116.189.31.172.in-addr.arpa_PTR]
module.vms.module.napp-prd1.aws_route53_record.additional-reverse["0"]: Refreshing state... [id=Z07534501KETL314B9LHZ_161.0.120.10.in-addr.arpa_PTR]
module.vms.module.unifi.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_unifi1.prod.beryju.org_A]
module.vms.module.gitlab.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_gitlab1.prod.beryju.org_A]
module.vms.module.napp-prd2.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_160.20.120.10.in-addr.arpa_PTR]
module.vms.module.ak-dev-dc.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_72.0.120.10.in-addr.arpa_PTR]
module.vms.module.gh-runner.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_gh-runner1.prod.beryju.org_A]
module.vms.module.rancher.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_73.0.120.10.in-addr.arpa_PTR]
module.vms.module.k8s-prd-w[2].module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_84.0.120.10.in-addr.arpa_PTR]
module.vms.module.puppet.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_puppet1.prod.beryju.org_A]
module.vms.module.ext-backup-s3.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_backup-s3.prod.beryju.org_A]
module.vms.module.napp-prd1.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclprd1.prod.beryju.org_A]
module.vms.module.vcenter.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_vc1.prod.beryju.org_A]
module.vms.module.gh-runner.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_87.0.120.10.in-addr.arpa_PTR]
module.vms.module.napp-prd2.aws_route53_record.additional["0"]: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclprd2n1.prod.beryju.org_A]
module.vms.module.ext-backup-s3.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_145.244.61.202.in-addr.arpa_PTR]
module.vms.module.mc.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_59.0.120.10.in-addr.arpa_PTR]
module.vms.module.napp-bck1.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_nappclbck1.prod.beryju.org_A]
module.vms.module.mon.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_74.0.120.10.in-addr.arpa_PTR]
module.vms.module.k8s-prd-w[0].module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_k8s-prd-w1.prod.beryju.org_A]
module.vms.module.ak-dev-dc.module.net.aws_route53_record.main: Refreshing state... [id=Z075720839VZLEYWCGF7B_ak-dev-dc1.lab.beryju.org_A]
module.vms.module.napp-bck1.aws_route53_record.additional-reverse["0"]: Refreshing state... [id=Z07534501KETL314B9LHZ_115.189.31.172.in-addr.arpa_PTR]
module.vms.module.napp-bck1.aws_route53_record.additional-reverse["1"]: Refreshing state... [id=Z07534501KETL314B9LHZ_117.189.31.172.in-addr.arpa_PTR]
module.vms.module.napp-prd1.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_160.0.120.10.in-addr.arpa_PTR]
module.vms.module.netbox.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_netbox1.prod.beryju.org_A]
module.vms.module.rancher.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_rancher1.prod.beryju.org_A]
module.vms.module.mc-peaceful.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_mc2.prod.beryju.org_A]
module.vms.module.k8s-prd-c.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_k8s-prd-c1.prod.beryju.org_A]
module.vms.module.k8s-prd-w[0].module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_81.0.120.10.in-addr.arpa_PTR]
module.vms.module.gitlab.module.net.aws_route53_record.main-reverse: Refreshing state... [id=Z07534501KETL314B9LHZ_82.0.120.10.in-addr.arpa_PTR]
module.vms.module.vault.module.net.aws_route53_record.main: Refreshing state... [id=Z07572133PAASWDIXZUA0_vault1.prod.beryju.org_A]
module.grafana.grafana_dashboard.k8s-nginx: Refreshing state... [id=nginx]
module.grafana.grafana_dashboard.k8s-flux-control-plane: Refreshing state... [id=flux-control-plane]
module.grafana.grafana_dashboard.k8s-flux-cluster: Refreshing state... [id=flux-cluster]
module.grafana.grafana_dashboard.pilot-dashboard: Refreshing state... [id=3--MLVZZk]
module.grafana.grafana_dashboard.istio-extension-dashboard: Refreshing state... [id=7PAV7ctGz]
module.grafana.grafana_dashboard.istio-mesh-dashboard: Refreshing state... [id=G8wLrJIZk]
module.grafana.grafana_dashboard.istio-service-dashboard: Refreshing state... [id=LJ_uJAvmk]
module.grafana.grafana_dashboard.istio-performance-dashboard: Refreshing state... [id=vu8e0VWZk]
module.authentik.module.authentik-app-unifi.authentik_provider_proxy.provider: Refreshing state... [id=87]
module.grafana.grafana_dashboard.istio-workload-dashboard: Refreshing state... [id=UbsSZTDik]
module.authentik.module.authentik-app-prom.authentik_provider_proxy.provider: Refreshing state... [id=85]
module.authentik.module.authentik-app-oxidized.authentik_provider_proxy.provider: Refreshing state... [id=74]
module.authentik.module.authentik-app-tautulli.authentik_provider_proxy.provider: Refreshing state... [id=81]
module.authentik.module.authentik-app-radarr.authentik_provider_proxy.provider: Refreshing state... [id=79]
module.authentik.module.authentik-app-home-assistant.authentik_provider_proxy.provider: Refreshing state... [id=71]
module.authentik.module.authentik-app-sabnzbd.authentik_provider_proxy.provider: Refreshing state... [id=73]
module.authentik.module.authentik-app-thanos.authentik_provider_proxy.provider: Refreshing state... [id=86]
module.authentik.module.authentik-app-code-server.authentik_provider_proxy.provider: Refreshing state... [id=72]
module.aws_route53.aws_route53_zone.jela-io: Refreshing state... [id=Z21H1D33A3ZJYB]
module.aws_route53.aws_route53_zone.rev-194-56-224: Refreshing state... [id=Z23O0BB7JVN6YM]
module.aws_route53.aws_route53_zone.beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV]
module.aws_route53.aws_route53_zone.ukch-at: Refreshing state... [id=Z054377719MRHNFBA7V47]
module.aws_route53.aws_route53_zone.goauthentik-io: Refreshing state... [id=Z01991371BCNAIWGVM83O]
module.aws_route53.aws_route53_zone.tigs-mom: Refreshing state... [id=Z0667997ASFW2UF4CHSM]
module.aws.aws_vpc.main: Refreshing state... [id=vpc-0946592d80ad9dda1]
module.authentik.module.authentik-app-alertmanager.authentik_provider_proxy.provider: Refreshing state... [id=70]
module.aws_ses_forwarder.aws_s3_bucket.bucket: Refreshing state... [id=beryjuorg-ses-forward-prod]
module.aws_ses_forwarder.aws_lambda_function.email-forwader: Refreshing state... [id=beryjuorg-ses-forward]
module.authentik.authentik_flow_stage_binding.ldap-login-bind: Refreshing state... [id=34dcda9e-9644-426c-a41f-f837bf3ed42b]
module.authentik.authentik_provider_saml.sentry: Refreshing state... [id=8]
module.authentik.authentik_provider_saml.aws: Refreshing state... [id=1]
module.authentik.module.authentik-app-puppetboard.authentik_provider_proxy.provider: Refreshing state... [id=69]
module.authentik.module.authentik-app-sonarr.authentik_provider_proxy.provider: Refreshing state... [id=78]
module.authentik.authentik_stage_identification.ldap-flow-identification: Refreshing state... [id=cce66f4c-9087-422b-8833-cb4bbff1ec36]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-pod: Refreshing state... [id=6581e46e4e5c7ba40a07646395ef7b23]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-pod-total: Refreshing state... [id=7a18067ce943a40ae25454675c19ff5c]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-alertmanager-overview: Refreshing state... [id=alertmanager-overview]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-node: Refreshing state... [id=200ac8fdbfbb74b39aff88118e4d1c2c]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-node-rsrc-use: Refreshing state... [id=rd7lDJxnk]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-persistentvolumesusage: Refreshing state... [id=919b92a8e8041bd567af9edab12c840c]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-cluster: Refreshing state... [id=efa86fd1d0c121a26444b636a3f509a8]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-namespace: Refreshing state... [id=85a562078cdf77779eaa1add43ccec1e]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-node-cluster-rsrc-use: Refreshing state... [id=vnG_DJb7z]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-namespace-by-pod: Refreshing state... [id=8b7a8b326d7a6f1f04244066368c67af]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-scheduler: Refreshing state... [id=2e6b6a3b4bddf1427b3a55aa1311c656]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-controller-manager: Refreshing state... [id=72e0e05bef5099e5f049b05fdc429ed4]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-workloads-namespace: Refreshing state... [id=a87fb0d919ec0ea5f6543124e16c42a5]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-kubelet: Refreshing state... [id=3138fa155d5915769fbded898ac09fd9]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-k8s-resources-workload: Refreshing state... [id=a164a7f0339f99e89cea5cb47e9be617]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-prometheus-remote-write: Refreshing state... [id=HfMlD1xnz]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-cluster-total: Refreshing state... [id=ff635a025bcfea7bc3dd4f508990a3e9]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-apiserver: Refreshing state... [id=09ec8aa1e996d6ffcd6817bbaff4db1b]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-nodes: Refreshing state... [id=wpTuBg_7k]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-workload-total: Refreshing state... [id=728bf77cc1166d2f3133bf25846876cc]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-prometheus: Refreshing state... [id=pCZlvJbnz]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-grafana-overview: Refreshing state... [id=6be0s85Mk]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-proxy: Refreshing state... [id=632e265de029684c40b21cb76bca4f94]
module.grafana.module.k8s-dashboards.grafana_dashboard.k8s-namespace-by-workload: Refreshing state... [id=bbb2a765a623ae38130206c7d94a160f]
module.authentik.module.authentik-app-oxidized.authentik_application.app: Refreshing state... [id=oxidized]
module.authentik.module.authentik-app-unifi.authentik_application.app: Refreshing state... [id=unifi]
module.authentik.module.authentik-app-prom.authentik_application.app: Refreshing state... [id=prometheus]
module.authentik.module.authentik-app-tautulli.authentik_application.app: Refreshing state... [id=tautulli]
module.authentik.module.authentik-app-home-assistant.authentik_application.app: Refreshing state... [id=home-assistant]
module.authentik.module.authentik-app-radarr.authentik_application.app: Refreshing state... [id=radarr]
module.authentik.module.authentik-app-thanos.authentik_application.app: Refreshing state... [id=thanos]
module.authentik.module.authentik-app-sabnzbd.authentik_application.app: Refreshing state... [id=sabnzbd]
module.authentik.module.authentik-app-code-server.authentik_application.app: Refreshing state... [id=code-server]
module.aws_route53.aws_route53_record.jela-main: Refreshing state... [id=Z21H1D33A3ZJYB_jela.io_A]
module.aws_route53.aws_route53_record.jela-requests: Refreshing state... [id=Z21H1D33A3ZJYB_requests.jela.io_A]
module.aws_route53.aws_route53_record.jela-wks: Refreshing state... [id=Z21H1D33A3ZJYB_wks.jela.io_A]
module.aws_route53.aws_route53_record.jela-dj: Refreshing state... [id=Z21H1D33A3ZJYB_dj.jela.io_CNAME]
module.aws_route53.aws_route53_zone.lab-beryju-org: Refreshing state... [id=Z075720839VZLEYWCGF7B]
module.aws_route53.aws_route53_zone.int-rev: Refreshing state... [id=Z07534501KETL314B9LHZ]
module.aws_route53.aws_route53_zone.prod-beryju-org: Refreshing state... [id=Z07572133PAASWDIXZUA0]
module.aws_route53.aws_route53_zone.k8s-beryju-org: Refreshing state... [id=Z081580334PV7LETLFHDZ]
module.aws_route53.aws_route53_record.analytics: Refreshing state... [id=ZYNWRNUP3ZIYV_analytics.beryju.org_A]
module.aws_route53.aws_route53_record.k8s-istio: Refreshing state... [id=ZYNWRNUP3ZIYV_k8s-prd-istio._aliases.beryju.org_A]
module.aws_route53.aws_route53_record.monitoring: Refreshing state... [id=ZYNWRNUP3ZIYV_monitoring.beryju.org_A]
module.aws_route53.aws_route53_record.registry-beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_registry.beryju.org_A]
module.aws_route53.aws_route53_record.id-beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_id.beryju.org_A]
module.aws_route53.aws_route53_record.vault: Refreshing state... [id=ZYNWRNUP3ZIYV_vault.beryju.org_A]
module.aws_route53.aws_route53_record.beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_beryju.org_A]
module.aws_route53.aws_route53_record.sentry: Refreshing state... [id=ZYNWRNUP3ZIYV_sentry.beryju.org_A]
module.aws_route53.aws_route53_record.blog-beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_blog.beryju.org_CNAME]
module.aws_route53.aws_route53_record.k8s: Refreshing state... [id=ZYNWRNUP3ZIYV_k8s-prd._aliases.beryju.org_A]
module.aws_route53.aws_route53_record.guac-beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_guac.beryju.org_A]
module.aws_route53.aws_route53_record.hass-ext: Refreshing state... [id=ZYNWRNUP3ZIYV_hass-ext.beryju.org_A]
module.aws_route53.aws_route53_record.proxy-registry-beryju-org: Refreshing state... [id=ZYNWRNUP3ZIYV_proxy.registry.beryju.org_A]
module.aws.aws_subnet.main: Refreshing state... [id=subnet-07d41cd9da45917e9]
module.aws_route53.aws_route53_record.goauthentik-charts: Refreshing state... [id=Z01991371BCNAIWGVM83O_charts.goauthentik.io_CNAME]
module.aws_route53.aws_route53_record.goauthentik-version: Refreshing state... [id=Z01991371BCNAIWGVM83O_version.goauthentik.io_CNAME]
module.aws_route53.aws_route53_record.goauthentik-main: Refreshing state... [id=Z01991371BCNAIWGVM83O_goauthentik.io_A]
module.aws_route53.aws_route53_record.goauthentik-wildcard: Refreshing state... [id=Z01991371BCNAIWGVM83O_*.goauthentik.io_CNAME]
module.authentik.module.authentik-app-alertmanager.authentik_application.app: Refreshing state... [id=alertmanager]
module.authentik.authentik_application.sentry: Refreshing state... [id=sentry]
module.authentik.authentik_application.aws: Refreshing state... [id=amazon-web-services]
module.authentik.module.authentik-app-puppetboard.authentik_application.app: Refreshing state... [id=puppetboard]
module.authentik.module.authentik-app-sonarr.authentik_application.app: Refreshing state... [id=sonarr]
module.authentik.authentik_flow_stage_binding.ldap-identification-binding: Refreshing state... [id=7b9a3ea0-4b92-4245-bbf0-3fa273a9611e]
module.authentik.authentik_outpost.k8s-proxy: Refreshing state... [id=bcb33826-b686-4d06-9434-d1355c2bc6c3]
module.authentik.module.authentik-app-prom.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=f7c1ea3f-8232-4696-b438-f679a319a6a5]
module.authentik.module.authentik-app-oxidized.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=6a7bdac6-57f6-4d8b-ad4d-6328512086a5]
module.authentik.module.authentik-app-unifi.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=2f2a276d-eebf-4569-842a-203a3b9da151]
module.authentik.module.authentik-app-tautulli.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=b62d1456-6717-4241-a9b1-40e785b60d66]
module.authentik.module.authentik-app-thanos.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=93fd010f-7649-496a-b25d-aa583981fa13]
module.authentik.module.authentik-app-home-assistant.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=2530c287-46ea-4894-b5ad-44d1d4f93480]
module.authentik.module.authentik-app-radarr.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=bd23c757-c2f3-4d6b-b682-e2cfe6a08c1f]
module.authentik.module.authentik-app-sabnzbd.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=65d90c48-1604-4d2d-b761-a95ff73594e6]
module.authentik.module.authentik-app-code-server.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=266d5bfb-e87b-48fb-9bed-6d2dab2a7ca1]
module.aws_route53.aws_route53_record.goauthentik-my: Refreshing state... [id=Z01991371BCNAIWGVM83O_*.my.goauthentik.io_CNAME]
module.authentik.module.authentik-app-alertmanager.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=7b79a13b-151d-4a42-89a7-96b5dee14c96]
module.authentik.authentik_policy_binding.ak_acl_sentry: Refreshing state... [id=8c0c0876-0766-473e-9f2b-5ef0cd4668dc]
module.authentik.authentik_policy_binding.sentry: Refreshing state... [id=9e289c8d-5607-4aa8-82d6-453bd544de30]
module.authentik.authentik_policy_binding.aws-access: Refreshing state... [id=3ed1acc1-6656-4d77-ba51-b24cdf6072ff]
module.authentik.module.authentik-app-puppetboard.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=0fcfa104-c9c3-4970-a192-1208646f01d5]
module.vms.module.unifi.vsphere_virtual_machine.vm: Refreshing state... [id=422ad7fa-9a53-9ae6-2566-e4457c2c02c4]
module.vms.module.plex.vsphere_virtual_machine.vm: Refreshing state... [id=422a8574-5ded-e8ab-09c0-996dac895600]
module.authentik.module.authentik-app-sonarr.authentik_policy_binding.app-access["c69c7316-547f-4fb4-bacc-512fba95b687"]: Refreshing state... [id=ae2d91e6-0181-4772-bc95-b1d285a0d995]
module.vms.module.ak-dev-dc.vsphere_virtual_machine.vm: Refreshing state... [id=422a52c0-e016-b95c-4dea-89c2aeac0989]
module.vms.module.gitlab.vsphere_virtual_machine.vm: Refreshing state... [id=422a28a5-9447-fe6b-7838-8b4de223dca5]
module.vms.module.mon.vsphere_virtual_machine.vm: Refreshing state... [id=422a2d3d-226c-b016-a58a-0739cefe3eda]
module.vms.module.mc.vsphere_virtual_machine.vm: Refreshing state... [id=42369c72-d8a7-f75f-cda3-e2c57ad2f977]
module.vms.module.analytics.vsphere_virtual_machine.vm: Refreshing state... [id=422aa2ae-10fe-4256-8ccf-e6b31016eaff]
module.vms.module.vault.vsphere_virtual_machine.vm: Refreshing state... [id=422adc7c-7a45-bc10-a6dd-c549aa8b6e0a]
module.vms.module.k8s-prd-c.vsphere_virtual_machine.vm: Refreshing state... [id=422b52d1-fb92-04a9-b43d-91933a81dbe7]
module.vms.module.netbox.vsphere_virtual_machine.vm: Refreshing state... [id=42365329-6ab9-33c9-c722-61d8d924d94f]
module.vms.module.puppet.vsphere_virtual_machine.vm: Refreshing state... [id=422b68fe-d917-560b-2f6e-714fa2ffb448]
module.vms.module.gh-runner.vsphere_virtual_machine.vm: Refreshing state... [id=422b7367-8327-471b-0a31-ec03867a7a8a]
module.vms.module.ak-dev-k3s.vsphere_virtual_machine.vm: Refreshing state... [id=422a6d68-5a90-f519-dea9-70fa8184b2bb]
module.vms.module.mc-peaceful.vsphere_virtual_machine.vm: Refreshing state... [id=422b50ab-ec53-2904-217a-02a94e020c03]
module.vms.module.rancher.vsphere_virtual_machine.vm: Refreshing state... [id=422aea73-816e-39e9-22b6-2a8e5804d9a0]
module.vms.module.dev.vsphere_virtual_machine.vm: Refreshing state... [id=422ac021-d323-8088-03c7-aceb86cb34d6]
module.vms.module.nas.vsphere_virtual_machine.vm: Refreshing state... [id=422a04e7-1bf7-d6de-b6e2-8ffb482f795a]
module.vms.module.k8s-prd-w[3].vsphere_virtual_machine.vm: Refreshing state... [id=422b9eee-8df0-64ed-26a1-b6e00485645f]
module.vms.module.k8s-prd-w[0].vsphere_virtual_machine.vm: Refreshing state... [id=422aa5c1-686d-6fe1-c154-1f8558667c40]
module.vms.module.k8s-prd-w[2].vsphere_virtual_machine.vm: Refreshing state... [id=422b7880-fc63-d274-d8f8-ff2cfa5d5e59]
module.vms.module.k8s-prd-w[1].vsphere_virtual_machine.vm: Refreshing state... [id=422adfdf-c312-afd2-b64c-09654a622ea3]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.vms.module.esxi-defr.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_esxi3.prod.beryju.org_A"
        name    = "esxi3.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.esxi-defr.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_20.20.120.10.in-addr.arpa_PTR"
        name    = "20.20.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.esxi-uk.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_esxi4.prod.beryju.org_A"
        name    = "esxi4.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.esxi-uk.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_10.3.120.10.in-addr.arpa_PTR"
        name    = "10.3.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.ext-backup-s3.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_backup-s3.prod.beryju.org_A"
        name    = "backup-s3.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.ext-backup-s3.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_145.244.61.202.in-addr.arpa_PTR"
        name    = "145.244.61.202.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.ext-sentry1.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_sentry1.prod.beryju.org_A"
        name    = "sentry1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.ext-sentry1.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_168.239.61.202.in-addr.arpa_PTR"
        name    = "168.239.61.202.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional["0"] has changed
  ~ resource "aws_route53_record" "additional" {
        id      = "Z07572133PAASWDIXZUA0_nappclbck1n1.prod.beryju.org_A"
        name    = "nappclbck1n1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional["1"] has changed
  ~ resource "aws_route53_record" "additional" {
        id      = "Z07572133PAASWDIXZUA0_nappclbck1n1sp.prod.beryju.org_A"
        name    = "nappclbck1n1sp.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional-reverse["0"] has changed
  ~ resource "aws_route53_record" "additional-reverse" {
        id      = "Z07534501KETL314B9LHZ_115.189.31.172.in-addr.arpa_PTR"
        name    = "115.189.31.172.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional-reverse["1"] has changed
  ~ resource "aws_route53_record" "additional-reverse" {
        id      = "Z07534501KETL314B9LHZ_117.189.31.172.in-addr.arpa_PTR"
        name    = "117.189.31.172.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_nappclbck1.prod.beryju.org_A"
        name    = "nappclbck1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-bck1.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_116.189.31.172.in-addr.arpa_PTR"
        name    = "116.189.31.172.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd1.aws_route53_record.additional["0"] has changed
  ~ resource "aws_route53_record" "additional" {
        id      = "Z07572133PAASWDIXZUA0_nappclprd1n1.prod.beryju.org_A"
        name    = "nappclprd1n1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd1.aws_route53_record.additional-reverse["0"] has changed
  ~ resource "aws_route53_record" "additional-reverse" {
        id      = "Z07534501KETL314B9LHZ_161.0.120.10.in-addr.arpa_PTR"
        name    = "161.0.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd1.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_nappclprd1.prod.beryju.org_A"
        name    = "nappclprd1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd1.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_160.0.120.10.in-addr.arpa_PTR"
        name    = "160.0.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd2.aws_route53_record.additional["0"] has changed
  ~ resource "aws_route53_record" "additional" {
        id      = "Z07572133PAASWDIXZUA0_nappclprd2n1.prod.beryju.org_A"
        name    = "nappclprd2n1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd2.aws_route53_record.additional-reverse["0"] has changed
  ~ resource "aws_route53_record" "additional-reverse" {
        id      = "Z07534501KETL314B9LHZ_161.20.120.10.in-addr.arpa_PTR"
        name    = "161.20.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd2.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_nappclprd2.prod.beryju.org_A"
        name    = "nappclprd2.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.napp-prd2.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_160.20.120.10.in-addr.arpa_PTR"
        name    = "160.20.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.vcenter.aws_route53_record.main has changed
  ~ resource "aws_route53_record" "main" {
        id      = "Z07572133PAASWDIXZUA0_vc1.prod.beryju.org_A"
        name    = "vc1.prod.beryju.org"
        # (5 unchanged attributes hidden)
    }

  # module.vms.module.vcenter.aws_route53_record.main-reverse has changed
  ~ resource "aws_route53_record" "main-reverse" {
        id      = "Z07534501KETL314B9LHZ_2.0.120.10.in-addr.arpa_PTR"
        name    = "2.0.120.10.in-addr.arpa"
        # (5 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.aws_ses_forwarder.aws_lambda_function.email-forwader will be updated in-place
  ~ resource "aws_lambda_function" "email-forwader" {
        id                             = "beryjuorg-ses-forward"
      ~ last_modified                  = "2022-05-05T13:55:40.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:eu-west-1:471432361072:function:beryjuorg-ses-forward:21" -> (known after apply)
      ~ source_code_hash               = "bAVys+21yHTYjJUPGrLrh49Dml3zDYH8YxOZEV64ov0=" -> "cBtmx2Bq7EBNS0d/JnkxCZR9yBpaqOYrEMPbQ1RGZJE="
        tags                           = {}
      ~ version                        = "21" -> (known after apply)
        # (16 unchanged attributes hidden)



        # (3 unchanged blocks hidden)
    }

  # module.vms.module.ak-dev-dc.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ak-dev-dc1.lab.beryju.org"
      + records         = [
          + "10.120.0.72",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z075720839VZLEYWCGF7B"
    }

  # module.vms.module.ak-dev-dc.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "72.0.120.10.in-addr.arpa"
      + records         = [
          + "ak-dev-dc1.lab.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.ak-dev-k3s.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "ak-dev-k3s1.lab.beryju.org"
      + records         = [
          + "10.120.0.67",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z075720839VZLEYWCGF7B"
    }

  # module.vms.module.ak-dev-k3s.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "67.0.120.10.in-addr.arpa"
      + records         = [
          + "ak-dev-k3s1.lab.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.analytics.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "analytics1.prod.beryju.org"
      + records         = [
          + "10.120.0.85",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.analytics.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "85.0.120.10.in-addr.arpa"
      + records         = [
          + "analytics1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.dev.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "dev1.lab.beryju.org"
      + records         = [
          + "10.120.99.2",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z075720839VZLEYWCGF7B"
    }

  # module.vms.module.dev.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "2.99.120.10.in-addr.arpa"
      + records         = [
          + "dev1.lab.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.esxi-defr.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "esxi3.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_esxi3.prod.beryju.org_A" -> null
      - name    = "esxi3.prod.beryju.org" -> null
      - records = [
          - "10.120.20.20",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.esxi-defr.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "20.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_20.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "20.20.120.10.in-addr.arpa" -> null
      - records = [
          - "esxi3.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.esxi-uk.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "esxi4.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_esxi4.prod.beryju.org_A" -> null
      - name    = "esxi4.prod.beryju.org" -> null
      - records = [
          - "10.120.3.10",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.esxi-uk.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "10.3.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_10.3.120.10.in-addr.arpa_PTR" -> null
      - name    = "10.3.120.10.in-addr.arpa" -> null
      - records = [
          - "esxi4.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.ext-backup-s3.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "backup-s3.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_backup-s3.prod.beryju.org_A" -> null
      - name    = "backup-s3.prod.beryju.org" -> null
      - records = [
          - "202.61.244.145",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.ext-backup-s3.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "145.244.61.202.in-addr.arpa.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_145.244.61.202.in-addr.arpa_PTR" -> null
      - name    = "145.244.61.202.in-addr.arpa" -> null
      - records = [
          - "backup-s3.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.ext-sentry1.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "sentry1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_sentry1.prod.beryju.org_A" -> null
      - name    = "sentry1.prod.beryju.org" -> null
      - records = [
          - "202.61.239.168",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.ext-sentry1.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "168.239.61.202.in-addr.arpa.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_168.239.61.202.in-addr.arpa_PTR" -> null
      - name    = "168.239.61.202.in-addr.arpa" -> null
      - records = [
          - "sentry1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.gh-runner.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gh-runner1.prod.beryju.org"
      + records         = [
          + "10.120.0.87",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.gh-runner.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "87.0.120.10.in-addr.arpa"
      + records         = [
          + "gh-runner1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.gitlab.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gitlab1.prod.beryju.org"
      + records         = [
          + "10.120.0.82",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.gitlab.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "82.0.120.10.in-addr.arpa"
      + records         = [
          + "gitlab1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.hass.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "hass1.prod.beryju.org"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.hass.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = [
          + "hass1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.hass.vsphere_virtual_machine.vm will be created
  + resource "vsphere_virtual_machine" "vm" {
      + annotation                              = (known after apply)
      + boot_retry_delay                        = 10000
      + change_version                          = (known after apply)
      + cpu_limit                               = -1
      + cpu_share_count                         = (known after apply)
      + cpu_share_level                         = "normal"
      + datastore_cluster_id                    = "group-p112"
      + datastore_id                            = (known after apply)
      + default_ip_address                      = (known after apply)
      + ept_rvi_mode                            = "automatic"
      + extra_config                            = {
          + "guestinfo.metadata"          = "aW5zdGFuY2UtaWQ6IGhhc3MxLnByb2QuYmVyeWp1Lm9yZwpob3N0bmFtZTogaGFzczEucHJvZC5iZXJ5anUub3JnCnByZWZlcl9mcWRuX292ZXJfaG9zdG5hbWU6IHRydWUKZnFkbjogaGFzczEucHJvZC5iZXJ5anUub3JnCmxvY2FsLWhvc3RuYW1lOiBoYXNzMS5wcm9kLmJlcnlqdS5vcmcKd2FpdC1vbi1uZXR3b3JrOgogIGlwdjQ6IHRydWUK"
          + "guestinfo.metadata.encoding" = "base64"
          + "guestinfo.userdata"          = "I2Nsb3VkLWNvbmZpZwphcHQ6CiAgcHJpbWFyeToKICAgIC0gYXJjaGVzOiBbZGVmYXVsdF0KICAgICAgdXJpOiAibWlycm9yOi8vbWlycm9ycy51YnVudHUuY29tL21pcnJvcnMudHh0Igp1c2VyczoKICAtIG5hbWU6IGplbnMKICAgIHN1ZG86IEFMTD0oQUxMKSBOT1BBU1NXRDpBTEwKICAgIGdyb3VwczogdXNlcnMsIHN1ZG8KICAgIHNzaF9pbXBvcnRfaWQ6CiAgICAgIC0gZ2g6QmVyeUp1CiAgICBzaGVsbDogL2Jpbi9iYXNoCnB1cHBldDoKICBpbnN0YWxsOiB0cnVlCiAgaW5zdGFsbF90eXBlOiAiYWlvIgogIGNvbGxlY3Rpb246ICJwdXBwZXQ3IgogIGV4ZWM6IHRydWUKICBjb25mOgogICAgbWFpbjoKICAgICAgc2VydmVyOiAicHVwcGV0LmluZnJhLmJlcnlqdS5vcmciCiAgICAgIGNlcnRuYW1lOiBoYXNzMS5wcm9kLmJlcnlqdS5vcmcKCm1hbmFnZV9yZXNvbHZfY29uZjogdHJ1ZQpyZXNvbHZfY29uZjoKICBzZWFyY2hkb21haW5zOgogICAgLSBwcm9kLmJlcnlqdS5vcmcKCmJvb3RjbWQ6CiAgLSBob3N0bmFtZSBoYXNzMS5wcm9kLmJlcnlqdS5vcmcK"
          + "guestinfo.userdata.encoding" = "base64"
        }
      + firmware                                = "bios"
      + force_power_off                         = true
      + guest_id                                = "ubuntu64Guest"
      + guest_ip_addresses                      = (known after apply)
      + hardware_version                        = (known after apply)
      + host_system_id                          = (known after apply)
      + hv_mode                                 = "hvAuto"
      + id                                      = (known after apply)
      + ide_controller_count                    = 2
      + imported                                = (known after apply)
      + latency_sensitivity                     = "normal"
      + memory                                  = 2048
      + memory_limit                            = -1
      + memory_share_count                      = (known after apply)
      + memory_share_level                      = "normal"
      + migrate_wait_timeout                    = 30
      + moid                                    = (known after apply)
      + name                                    = "hass1.prod.beryju.org"
      + num_cores_per_socket                    = 1
      + num_cpus                                = 2
      + power_state                             = (known after apply)
      + poweron_timeout                         = 300
      + reboot_required                         = (known after apply)
      + resource_pool_id                        = "resgroup-16"
      + run_tools_scripts_after_power_on        = true
      + run_tools_scripts_after_resume          = true
      + run_tools_scripts_before_guest_shutdown = true
      + run_tools_scripts_before_guest_standby  = true
      + sata_controller_count                   = 0
      + scsi_bus_sharing                        = "noSharing"
      + scsi_controller_count                   = 1
      + scsi_type                               = "pvscsi"
      + shutdown_wait_timeout                   = 3
      + storage_policy_id                       = (known after apply)
      + swap_placement_policy                   = "inherit"
      + sync_time_with_host                     = true
      + tools_upgrade_policy                    = "manual"
      + uuid                                    = (known after apply)
      + vapp_transport                          = (known after apply)
      + vmware_tools_status                     = (known after apply)
      + vmx_path                                = (known after apply)
      + wait_for_guest_ip_timeout               = 0
      + wait_for_guest_net_routable             = true
      + wait_for_guest_net_timeout              = 5

      + clone {
          + template_uuid = "564d4ef2-853a-f37e-4a03-9c882b6d34c9"
          + timeout       = 30
        }

      + disk {
          + attach            = false
          + controller_type   = "scsi"
          + datastore_id      = "<computed>"
          + device_address    = (known after apply)
          + disk_mode         = "persistent"
          + disk_sharing      = "sharingNone"
          + eagerly_scrub     = false
          + io_limit          = -1
          + io_reservation    = 0
          + io_share_count    = 0
          + io_share_level    = "normal"
          + keep_on_remove    = false
          + key               = 0
          + label             = "disk0"
          + path              = (known after apply)
          + size              = 25
          + storage_policy_id = (known after apply)
          + thin_provisioned  = true
          + unit_number       = 0
          + uuid              = (known after apply)
          + write_through     = false
        }

      + network_interface {
          + adapter_type          = "vmxnet3"
          + bandwidth_limit       = -1
          + bandwidth_reservation = 0
          + bandwidth_share_count = (known after apply)
          + bandwidth_share_level = "normal"
          + device_address        = (known after apply)
          + key                   = (known after apply)
          + mac_address           = (known after apply)
          + network_id            = "dvportgroup-111"
        }
    }

  # module.vms.module.k8s-prd-c.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s-prd-c1.prod.beryju.org"
      + records         = [
          + "10.120.0.83",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.k8s-prd-c.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "83.0.120.10.in-addr.arpa"
      + records         = [
          + "k8s-prd-c1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.k8s-prd-w[0].aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s-prd-w1.prod.beryju.org"
      + records         = [
          + "10.120.0.81",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.k8s-prd-w[0].aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "81.0.120.10.in-addr.arpa"
      + records         = [
          + "k8s-prd-w1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.k8s-prd-w[1].aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s-prd-w2.prod.beryju.org"
      + records         = [
          + "10.120.0.64",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.k8s-prd-w[1].aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "64.0.120.10.in-addr.arpa"
      + records         = [
          + "k8s-prd-w2.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.k8s-prd-w[2].aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s-prd-w3.prod.beryju.org"
      + records         = [
          + "10.120.0.84",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.k8s-prd-w[2].aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "84.0.120.10.in-addr.arpa"
      + records         = [
          + "k8s-prd-w3.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.k8s-prd-w[3].aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "k8s-prd-w4.prod.beryju.org"
      + records         = [
          + "10.120.0.86",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.k8s-prd-w[3].aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "86.0.120.10.in-addr.arpa"
      + records         = [
          + "k8s-prd-w4.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.mc.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mc1.prod.beryju.org"
      + records         = [
          + "10.120.0.59",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.mc.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "59.0.120.10.in-addr.arpa"
      + records         = [
          + "mc1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.mc-peaceful.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mc2.prod.beryju.org"
      + records         = [
          + "10.120.0.76",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.mc-peaceful.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "76.0.120.10.in-addr.arpa"
      + records         = [
          + "mc2.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.mon.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "mon1.prod.beryju.org"
      + records         = [
          + "10.120.0.74",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.mon.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "74.0.120.10.in-addr.arpa"
      + records         = [
          + "mon1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional["0"] will be destroyed
  # (because aws_route53_record.additional is not in configuration)
  - resource "aws_route53_record" "additional" {
      - fqdn    = "nappclbck1n1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclbck1n1.prod.beryju.org_A" -> null
      - name    = "nappclbck1n1.prod.beryju.org" -> null
      - records = [
          - "172.31.189.115",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional["1"] will be destroyed
  # (because aws_route53_record.additional is not in configuration)
  - resource "aws_route53_record" "additional" {
      - fqdn    = "nappclbck1n1sp.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclbck1n1sp.prod.beryju.org_A" -> null
      - name    = "nappclbck1n1sp.prod.beryju.org" -> null
      - records = [
          - "172.31.189.117",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional-reverse["0"] will be destroyed
  # (because aws_route53_record.additional-reverse is not in configuration)
  - resource "aws_route53_record" "additional-reverse" {
      - fqdn    = "115.189.31.172.in-addr.arpa.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_115.189.31.172.in-addr.arpa_PTR" -> null
      - name    = "115.189.31.172.in-addr.arpa" -> null
      - records = [
          - "nappclbck1n1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-bck1.aws_route53_record.additional-reverse["1"] will be destroyed
  # (because aws_route53_record.additional-reverse is not in configuration)
  - resource "aws_route53_record" "additional-reverse" {
      - fqdn    = "117.189.31.172.in-addr.arpa.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_117.189.31.172.in-addr.arpa_PTR" -> null
      - name    = "117.189.31.172.in-addr.arpa" -> null
      - records = [
          - "nappclbck1n1sp.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-bck1.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "nappclbck1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclbck1.prod.beryju.org_A" -> null
      - name    = "nappclbck1.prod.beryju.org" -> null
      - records = [
          - "172.31.189.116",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-bck1.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "116.189.31.172.in-addr.arpa.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_116.189.31.172.in-addr.arpa_PTR" -> null
      - name    = "116.189.31.172.in-addr.arpa" -> null
      - records = [
          - "nappclbck1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-prd1.aws_route53_record.additional["0"] will be destroyed
  # (because aws_route53_record.additional is not in configuration)
  - resource "aws_route53_record" "additional" {
      - fqdn    = "nappclprd1n1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclprd1n1.prod.beryju.org_A" -> null
      - name    = "nappclprd1n1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.161",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-prd1.aws_route53_record.additional-reverse["0"] will be destroyed
  # (because aws_route53_record.additional-reverse is not in configuration)
  - resource "aws_route53_record" "additional-reverse" {
      - fqdn    = "161.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_161.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "161.0.120.10.in-addr.arpa" -> null
      - records = [
          - "nappclprd1n1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-prd1.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "nappclprd1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclprd1.prod.beryju.org_A" -> null
      - name    = "nappclprd1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.160",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-prd1.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "160.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_160.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "160.0.120.10.in-addr.arpa" -> null
      - records = [
          - "nappclprd1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-prd2.aws_route53_record.additional["0"] will be destroyed
  # (because aws_route53_record.additional is not in configuration)
  - resource "aws_route53_record" "additional" {
      - fqdn    = "nappclprd2n1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclprd2n1.prod.beryju.org_A" -> null
      - name    = "nappclprd2n1.prod.beryju.org" -> null
      - records = [
          - "10.120.20.161",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-prd2.aws_route53_record.additional-reverse["0"] will be destroyed
  # (because aws_route53_record.additional-reverse is not in configuration)
  - resource "aws_route53_record" "additional-reverse" {
      - fqdn    = "161.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_161.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "161.20.120.10.in-addr.arpa" -> null
      - records = [
          - "nappclprd2n1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.napp-prd2.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "nappclprd2.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nappclprd2.prod.beryju.org_A" -> null
      - name    = "nappclprd2.prod.beryju.org" -> null
      - records = [
          - "10.120.20.160",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.napp-prd2.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "160.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_160.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "160.20.120.10.in-addr.arpa" -> null
      - records = [
          - "nappclprd2.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.nas.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "nas1.prod.beryju.org"
      + records         = [
          + "10.120.20.31",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.nas.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "31.20.120.10.in-addr.arpa"
      + records         = [
          + "nas1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.netbox.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "netbox1.prod.beryju.org"
      + records         = [
          + "10.120.0.68",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.netbox.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "68.0.120.10.in-addr.arpa"
      + records         = [
          + "netbox1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.plex.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "plex1.prod.beryju.org"
      + records         = [
          + "10.120.20.76",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.plex.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "76.20.120.10.in-addr.arpa"
      + records         = [
          + "plex1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.puppet.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "puppet1.prod.beryju.org"
      + records         = [
          + "10.120.0.80",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.puppet.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "80.0.120.10.in-addr.arpa"
      + records         = [
          + "puppet1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.rancher.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "rancher1.prod.beryju.org"
      + records         = [
          + "10.120.0.73",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.rancher.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "73.0.120.10.in-addr.arpa"
      + records         = [
          + "rancher1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.unifi.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "unifi1.prod.beryju.org"
      + records         = [
          + "10.120.20.74",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.unifi.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "74.20.120.10.in-addr.arpa"
      + records         = [
          + "unifi1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.vault.aws_route53_record.vm will be created
  + resource "aws_route53_record" "vm" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "vault1.prod.beryju.org"
      + records         = [
          + "10.120.0.69",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z07572133PAASWDIXZUA0"
    }

  # module.vms.module.vault.aws_route53_record.vm-reverse will be created
  + resource "aws_route53_record" "vm-reverse" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "69.0.120.10.in-addr.arpa"
      + records         = [
          + "vault1.prod.beryju.org",
        ]
      + ttl             = 300
      + type            = "PTR"
      + zone_id         = "Z07534501KETL314B9LHZ"
    }

  # module.vms.module.vcenter.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "vc1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_vc1.prod.beryju.org_A" -> null
      - name    = "vc1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.2",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.vcenter.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "2.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_2.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "2.0.120.10.in-addr.arpa" -> null
      - records = [
          - "vc1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.ak-dev-dc.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "ak-dev-dc1.lab.beryju.org" -> null
      - id      = "Z075720839VZLEYWCGF7B_ak-dev-dc1.lab.beryju.org_A" -> null
      - name    = "ak-dev-dc1.lab.beryju.org" -> null
      - records = [
          - "10.120.0.72",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z075720839VZLEYWCGF7B" -> null
    }

  # module.vms.module.ak-dev-dc.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "72.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_72.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "72.0.120.10.in-addr.arpa" -> null
      - records = [
          - "ak-dev-dc1.lab.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.ak-dev-k3s.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "ak-dev-k3s1.lab.beryju.org" -> null
      - id      = "Z075720839VZLEYWCGF7B_ak-dev-k3s1.lab.beryju.org_A" -> null
      - name    = "ak-dev-k3s1.lab.beryju.org" -> null
      - records = [
          - "10.120.0.67",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z075720839VZLEYWCGF7B" -> null
    }

  # module.vms.module.ak-dev-k3s.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "67.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_67.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "67.0.120.10.in-addr.arpa" -> null
      - records = [
          - "ak-dev-k3s1.lab.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.analytics.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "analytics1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_analytics1.prod.beryju.org_A" -> null
      - name    = "analytics1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.85",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.analytics.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "85.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_85.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "85.0.120.10.in-addr.arpa" -> null
      - records = [
          - "analytics1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.dev.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "dev1.lab.beryju.org" -> null
      - id      = "Z075720839VZLEYWCGF7B_dev1.lab.beryju.org_A" -> null
      - name    = "dev1.lab.beryju.org" -> null
      - records = [
          - "10.120.99.2",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z075720839VZLEYWCGF7B" -> null
    }

  # module.vms.module.dev.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "2.99.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_2.99.120.10.in-addr.arpa_PTR" -> null
      - name    = "2.99.120.10.in-addr.arpa" -> null
      - records = [
          - "dev1.lab.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.gh-runner.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "gh-runner1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_gh-runner1.prod.beryju.org_A" -> null
      - name    = "gh-runner1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.87",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.gh-runner.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "87.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_87.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "87.0.120.10.in-addr.arpa" -> null
      - records = [
          - "gh-runner1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.gitlab.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "gitlab1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_gitlab1.prod.beryju.org_A" -> null
      - name    = "gitlab1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.82",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.gitlab.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "82.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_82.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "82.0.120.10.in-addr.arpa" -> null
      - records = [
          - "gitlab1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.k8s-prd-c.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "k8s-prd-c1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_k8s-prd-c1.prod.beryju.org_A" -> null
      - name    = "k8s-prd-c1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.83",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.k8s-prd-c.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "83.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_83.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "83.0.120.10.in-addr.arpa" -> null
      - records = [
          - "k8s-prd-c1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.k8s-prd-w[0].module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "k8s-prd-w1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_k8s-prd-w1.prod.beryju.org_A" -> null
      - name    = "k8s-prd-w1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.81",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.k8s-prd-w[0].module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "81.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_81.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "81.0.120.10.in-addr.arpa" -> null
      - records = [
          - "k8s-prd-w1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.k8s-prd-w[1].module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "k8s-prd-w2.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_k8s-prd-w2.prod.beryju.org_A" -> null
      - name    = "k8s-prd-w2.prod.beryju.org" -> null
      - records = [
          - "10.120.0.64",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.k8s-prd-w[1].module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "64.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_64.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "64.0.120.10.in-addr.arpa" -> null
      - records = [
          - "k8s-prd-w2.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.k8s-prd-w[2].module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "k8s-prd-w3.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_k8s-prd-w3.prod.beryju.org_A" -> null
      - name    = "k8s-prd-w3.prod.beryju.org" -> null
      - records = [
          - "10.120.0.84",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.k8s-prd-w[2].module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "84.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_84.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "84.0.120.10.in-addr.arpa" -> null
      - records = [
          - "k8s-prd-w3.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.k8s-prd-w[3].module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "k8s-prd-w4.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_k8s-prd-w4.prod.beryju.org_A" -> null
      - name    = "k8s-prd-w4.prod.beryju.org" -> null
      - records = [
          - "10.120.0.86",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.k8s-prd-w[3].module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "86.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_86.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "86.0.120.10.in-addr.arpa" -> null
      - records = [
          - "k8s-prd-w4.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.mc.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "mc1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_mc1.prod.beryju.org_A" -> null
      - name    = "mc1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.59",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.mc.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "59.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_59.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "59.0.120.10.in-addr.arpa" -> null
      - records = [
          - "mc1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.mc-peaceful.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "mc2.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_mc2.prod.beryju.org_A" -> null
      - name    = "mc2.prod.beryju.org" -> null
      - records = [
          - "10.120.0.76",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.mc-peaceful.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "76.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_76.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "76.0.120.10.in-addr.arpa" -> null
      - records = [
          - "mc2.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.mon.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "mon1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_mon1.prod.beryju.org_A" -> null
      - name    = "mon1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.74",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.mon.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "74.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_74.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "74.0.120.10.in-addr.arpa" -> null
      - records = [
          - "mon1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.nas.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "nas1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_nas1.prod.beryju.org_A" -> null
      - name    = "nas1.prod.beryju.org" -> null
      - records = [
          - "10.120.20.31",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.nas.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "31.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_31.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "31.20.120.10.in-addr.arpa" -> null
      - records = [
          - "nas1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.netbox.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "netbox1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_netbox1.prod.beryju.org_A" -> null
      - name    = "netbox1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.68",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.netbox.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "68.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_68.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "68.0.120.10.in-addr.arpa" -> null
      - records = [
          - "netbox1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.plex.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "plex1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_plex1.prod.beryju.org_A" -> null
      - name    = "plex1.prod.beryju.org" -> null
      - records = [
          - "10.120.20.76",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.plex.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "76.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_76.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "76.20.120.10.in-addr.arpa" -> null
      - records = [
          - "plex1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.puppet.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "puppet1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_puppet1.prod.beryju.org_A" -> null
      - name    = "puppet1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.80",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.puppet.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "80.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_80.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "80.0.120.10.in-addr.arpa" -> null
      - records = [
          - "puppet1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.rancher.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "rancher1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_rancher1.prod.beryju.org_A" -> null
      - name    = "rancher1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.73",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.rancher.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "73.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_73.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "73.0.120.10.in-addr.arpa" -> null
      - records = [
          - "rancher1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.unifi.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "unifi1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_unifi1.prod.beryju.org_A" -> null
      - name    = "unifi1.prod.beryju.org" -> null
      - records = [
          - "10.120.20.74",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.unifi.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "74.20.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_74.20.120.10.in-addr.arpa_PTR" -> null
      - name    = "74.20.120.10.in-addr.arpa" -> null
      - records = [
          - "unifi1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

  # module.vms.module.vault.module.net.aws_route53_record.main will be destroyed
  # (because aws_route53_record.main is not in configuration)
  - resource "aws_route53_record" "main" {
      - fqdn    = "vault1.prod.beryju.org" -> null
      - id      = "Z07572133PAASWDIXZUA0_vault1.prod.beryju.org_A" -> null
      - name    = "vault1.prod.beryju.org" -> null
      - records = [
          - "10.120.0.69",
        ] -> null
      - ttl     = 300 -> null
      - type    = "A" -> null
      - zone_id = "Z07572133PAASWDIXZUA0" -> null
    }

  # module.vms.module.vault.module.net.aws_route53_record.main-reverse will be destroyed
  # (because aws_route53_record.main-reverse is not in configuration)
  - resource "aws_route53_record" "main-reverse" {
      - fqdn    = "69.0.120.10.in-addr.arpa" -> null
      - id      = "Z07534501KETL314B9LHZ_69.0.120.10.in-addr.arpa_PTR" -> null
      - name    = "69.0.120.10.in-addr.arpa" -> null
      - records = [
          - "vault1.prod.beryju.org",
        ] -> null
      - ttl     = 300 -> null
      - type    = "PTR" -> null
      - zone_id = "Z07534501KETL314B9LHZ" -> null
    }

Plan: 45 to add, 1 to change, 66 to destroy.

Warning: Experimental feature "module_variable_optional_attrs" is active

  on modules/authentik_app/vars.tf line 2, in terraform:
   2:   experiments = [module_variable_optional_attrs]

Experimental features are subject to breaking changes in future minor or
patch releases, based on feedback.

If you have feedback on the design of this feature, please open a GitHub
issue to discuss it.

(and 31 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```
</details>
*Pusher: @renovate[bot], Action: `pull_request`*